<script setup>
onMounted(() => {
  uni.hideTabBar({
    success: () => {},
    fail: () => {},
  });
});
</script>

<template>
  <LayoutDefault title="隐私政策" bg="#fff" :minusHeight="0" :isLine="true">
    <template #left>
      <Black color="#262727" />
    </template>
    <div>
      <div pb-5px>天网互联科技智能锁软件许可及服务协议</div>
      <div pb-5px>【重要须知】</div>
      <div pb-5px>
        【天网互联科技 （深圳）有限公司】 （以下称“天网互联科技’
        或“我们”）在此特别提醒用户认真阅读、充分理解本《软件许可 及服务协议》
        （下称“本协议”）。用户应认真阅读、充分理解本 协议中各条款，
        特别涉及免除或者限制天网互联科技责任、 争 议解决和法律适用的条款。
        免除或者限制责任的条款将以粗体 标识， 您需要重点阅读。
        请您审慎阅读并选择接受或不接受本 协议
        （未成年人应在法定监护人陪同下阅读）。您的下载、安
        装、使用本软件以及账号获取和登录等行为将视为对本协议的 接受，
        并同意接受本协议各项条款的约束。
      </div>
      <div pb-5px>
        天网互联科技有权修订本协议，更新后的协议条款将公布于
        官网或软件，自公布之日起生效。用户可重新下载安装本软件
        或网站查阅最新版协议条款。 在天网互联科技修改本协议条款
        后，如果用户不接受修改后的条款， 请立即停止使用天网互联
        科技提供的“智能门锁”软件和服务， 用户继续使用天网互联科技
        提供的“智能门锁”软件和服务将被视为已接受了修改后的协议。
      </div>
      <div pb-5px>一、总则</div>
      <div pb-5px>
        1.1. 本协议是您（如下也称“用户”)与天网互联科技及其运营合
        作单位（如下简称“合作单位”）之间关于用户下载、安装、使用
        天网互联科技“智能门锁”软件 （下称“本软件”) 以及使用天网互
        联科技相关服务所订立的协议。
      </div>
      <div pb-5px>
        1.2. 本软件及服务是天网互联科技提供的安装在包括但不限于
        移动智能终端设备上的软件和服务， 为使用该智能终端的用户 提供绑定、
        操作智能产品等服务等。 1.3.
        本软件及服务的所有权和运营权均归天网互联科技所有。
      </div>
      <div v-for="v in 100" :key="v">1111111</div>
      <div>2222222222</div>
    </div>
  </LayoutDefault>
</template>

<style lang="scss">
page {
  overflow: hidden;
  height: 100%;
}
</style>
